import { Injectable } from '@angular/core';
import {Card} from "../models/Card";

const data: Card[] = [
  {
    title: "Card 1",
    content: "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. " +
      "Lorem Ipsum является стандартной \"рыбой\" для текстов на латинице с начала XVI века. " +
      "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum " +
      "является стандартной \"рыбой\" для текстов на латинице с начала XVI века. Lorem Ipsum - " +
      "это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной \"рыбой\" " +
      "для текстов на латинице с начала XVI века.",
    state: "default"
  },
  {
    title: "Card 2",
    content: "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. " +
      "Lorem Ipsum является стандартной \"рыбой\" для текстов на латинице с начала XVI века. " +
      "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum " +
      "является стандартной \"рыбой\" для текстов на латинице с начала XVI века. Lorem Ipsum - " +
      "это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной \"рыбой\" " +
      "для текстов на латинице с начала XVI века.",
    state: "default"
  },
  {
    title: "Card 3",
    content: "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. " +
      "Lorem Ipsum является стандартной \"рыбой\" для текстов на латинице с начала XVI века. " +
      "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum " +
      "является стандартной \"рыбой\" для текстов на латинице с начала XVI века. Lorem Ipsum - " +
      "это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной \"рыбой\" " +
      "для текстов на латинице с начала XVI века.",
    state: "default"
  },
  {
    title: "Card 4",
    content: "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. " +
      "Lorem Ipsum является стандартной \"рыбой\" для текстов на латинице с начала XVI века. " +
      "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum " +
      "является стандартной \"рыбой\" для текстов на латинице с начала XVI века. Lorem Ipsum - " +
      "это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной \"рыбой\" " +
      "для текстов на латинице с начала XVI века.",
    state: "default"
  },
  {
    title: "Card 5",
    content: "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. " +
      "Lorem Ipsum является стандартной \"рыбой\" для текстов на латинице с начала XVI века. " +
      "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum " +
      "является стандартной \"рыбой\" для текстов на латинице с начала XVI века. Lorem Ipsum - " +
      "это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной \"рыбой\" " +
      "для текстов на латинице с начала XVI века.",
    state: "default"
  },
  {
    title: "Card 6",
    content: "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. " +
      "Lorem Ipsum является стандартной \"рыбой\" для текстов на латинице с начала XVI века. " +
      "Lorem Ipsum - это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum " +
      "является стандартной \"рыбой\" для текстов на латинице с начала XVI века. Lorem Ipsum - " +
      "это текст-\"рыба\", часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной \"рыбой\" " +
      "для текстов на латинице с начала XVI века.",
    state: "default"
  }
]

@Injectable({
  providedIn: 'root'
})
export class CardService {

  private _cards: Card[] = [];
  public flippedCardIndex: number = -1;

  constructor() { }

  get cards(): Card[] {
    return this._cards;
  }

  initialize() {
    this._cards = data;
  }

  addCard(card: Card): void {
    data.push(card);
    this.initialize();
  }

  deleteCard(card: Card): void {
    let targetCardIndex = this._cards.indexOf(card);
    if (targetCardIndex !== -1) this._cards.splice(targetCardIndex, 1);
    this.flippedCardIndex = -1;
    this.initialize();
  }
}
